{"Los Angeles Lakers": {"coach": "Luke Walton", "players": ["Lonzo Ball", "V.J. Beachem", "Vander Blue", "Corey Brewer", "Thomas Bryant", "Kentavious Caldwell-Pope", "Alex Caruso", "Jordan Clarkson", "Luol Deng", "Tyler Ennis", "Josh Hart", "Brandon Ingram", "Kyle Kuzma", "Brook Lopez", "Larry Nance Jr.", "Julius Randle", "Thomas Robinson", "Briante Weber", "Metta World Peace", "Stephen Zimmerman", "Ivica Zubac"], "abbrev": "lal", "arena_name": "Staples Center", "arena_description": "The Lakers played at the Great Western Forum from 1967 to 1999. The last five Lakers championships (2000, 2001, 2002, 2009, 2010) have been earned while the team has called the $407 million Staples Center home. Several of the team's retired jerseys are on display at the arena, including those of Jerry West, Wilt Chamberlain, Earvin \"Magic\" Johnson, Kareem Abdul-Jabbar, Shaquille O'Neal and broadcaster Chick Hearn. L.A. Live is a 4-million-square-foot sports, residential and entertainment district adjacent to the arena and the Los Angeles Convention Center. In 2012, the arena hosted three playoff teams -- the Kings, Clippers and Lakers -- for the first time. Outside the arena are statues of Wayne Gretzky and Magic Johnson and Kareem Abdul-Jabbar, although all three sports icons played at the Great Western Forum -- where the Kings, Lakers and Sparks previously played. Other statues include boxer Oscar De La Hoya, Jerry West and longtime announcer Chick Hearn."}, "Chicago Bulls": {"coach": "Fred Hoiberg", "players": ["Ryan Arcidiacono", "Antonio Blakeney", "Kris Dunn", "Cristiano Felicio", "Jerian Grant", "Justin Holiday", "Zach LaVine", "Robin Lopez", "Lauri Markkanen", "Nikola Mirotic", "Anthony Morrow", "David Nwaba", "Cameron Payne", "Bobby Portis", "Denzel Valentine", "Dwyane Wade", "Paul Zipser"], "abbrev": "chi", "arena_name": "United Center", "arena_description": "The United Center is the largest arena in the NBA, according to the team website. Many amenities can be found at the United Center, including Fandemonium -- where fans can buy Bulls merchandise -- The Locker Room and The Windy City Grill. A statue of Michael Jordan, arguably the greatest player in NBA history, can be found outside of Gate 4 off Wood Street. He led the Bulls to three NBA titles before the team moved into the United Center and three more titles here in 1996, 1997 and 1998. The United Center also is home to the NHL's Blackhawks."}, "Philadelphia 76ers": {"coach": "Brett Brown", "players": ["Justin Anderson", "Jerryd Bayless", "Robert Covington", "Joel Embiid", "Markelle Fultz", "Richaun Holmes", "Amir Johnson", "Furkan Korkmaz", "Timothe Luwawu-Cabarrot", "T.J. McConnell", "Jahlil Okafor", "JJ Redick", "Dario Saric", "Ben Simmons", "Tiago Splitter", "Nik Stauskas"], "abbrev": "phi", "arena_name": "Wells Fargo Center", "arena_description": "Opened in 1996 as the CoreStates Center (its name changed to First Union Center in 1998, to the Wachovia Center in 2003 and to the Wells Fargo Center in 2010), the $206 million Wells Fargo Center replaced the adjacent Spectrum as the home of the 76ers and the NHL's Flyers. Fans can check out the Sixers I-Wall, which provides an interactive look at the history of the franchise. Tours are available Monday through Friday from 9 a.m. to 5 p.m. Commemorative bricks in the walkway outside Wells Fargo Center are available for sale. The arena has hosted the 2000 Republican National Convention, 2002 NBA All-Star Game and 2000 NCAA Women's Final Four. The arena was also the host of the second and third rounds of the NCAA basketball tournament in March 2013, while the NCAA Frozen Four hockey championships were set to be staged here in 2014."}, "San Antonio Spurs": {"coach": "Gregg Popovich", "players": ["LaMarcus Aldridge", "Kyle Anderson", "Joel Anthony", "Davis Bertans", "Jaron Blossomgame", "Matt Costello", "Bryn Forbes", "Pau Gasol", "Rudy Gay", "Manu Ginobili", "Danny Green", "Joffrey Lauvergne", "David Lee", "Kawhi Leonard", "Patty Mills", "Dejounte Murray", "Tony Parker", "Brandon Paul", "London Perrantes", "Derrick White"], "abbrev": "sa", "arena_name": "AT&T Center", "arena_description": "Starting as the Dallas Chaparrals of the ABA, the Spurs have played all over Texas and spent 20 years at HemisFair Arena in San Antonio before playing at the Alamodome from 1993 to 2002. They have found their greatest success at AT&T Center (which started as SBC Center until AT&T acquired SBC) by winning three of their four NBA titles since moving to the arena. Art representative of southern Texas can be found throughout the concourses, which also are designed with a fiesta flavor in mind. AT&T Center also is home to the WNBA's Silver Stars and the San Antonio Stock Show & Rodeo."}, "Houston Rockets": {"coach": "Mike D'Antoni", "players": ["Ryan Anderson", "Trevor Ariza", "Tarik Black", "Bobby Brown", "Clint Capela", "Eric Gordon", "James Harden", "Isaiah Hartenstein", "Nene Hilario", "Demetrius Jackson", "Shawn Long", "Luc Mbah a Moute", "Cameron Oliver", "Chinanu Onuaku", "Chris Paul", "Zhou Qi", "Tim Quarterman", "Isaiah Taylor", "PJ Tucker", "Troy Williams"], "abbrev": "hou", "arena_name": "Toyota Center", "arena_description": "Toyota Center is spread out over six blocks in the eastern edge of downtown Houston. The arena opened in 2003 at a cost of more than $200 million. The court is almost 32 feet below street level and provides the largest lower level of any arena in the country, according to the arena website. An interactive area, the Memorial Hermann Sky Court, at the north end of the upper concourse includes vertical jump, height and wingspan comparisons to players, as well as several other interactive kiosks. Toyota paid $100 million for naming rights. The Toyota Center hosted 2006 and 2013 NBA All-Star Games."}, "Detroit Pistons": {"coach": "Stan Van Gundy", "players": ["Avery Bradley", "Reggie Bullock", "Andre Drummond", "Henry Ellenson", "Langston Galloway", "Tobias Harris", "Reggie Jackson", "Stanley Johnson", "Luke Kennard", "Jon Leuer", "Boban Marjanovic", "Luis Montero", "Eric Moreland", "Ish Smith", "Anthony Tolliver", "Beno Udrih"], "abbrev": "det", "arena_name": "The Palace of Auburn Hills", "arena_description": "The Pistons have played at a few arenas since moving to Detroit from Fort Wayne, Ind., after the 1956-57 season, but they have called the Palace of Auburn Hills home since 1988. The arena was built for $75 million with private funds, is one of the NBA's largest and one of the few that has not had naming rights sold. The Palace has 193 luxury suites, one of the reasons the team has not pushed for a replacement despite its age. The team has won three NBA championships at the Palace. The arena also was the site of the Pacers-Pistons brawl (the Malice at the Palace) on Nov. 19, 2004, when the teams had an altercation and some Pacers went into the stands. Fans can visit the Hall of Fame and Museum to see memorabilia from the Pistons history."}, "Boston Celtics": {"coach": "Brad Stevens", "players": ["Kadeem Allen", "Aron Baynes", "Jabari Bird", "Jaylen Brown", "Gerald Green", "Gordon Hayward", "Al Horford", "Kyrie Irving", "Shane Larkin", "Marcus Morris", "Abdel Nader", "Semi Ojeleye", "Terry Rozier", "Marcus Smart", "Jayson Tatum", "Daniel Theis", "Guerschon Yabusele"], "abbrev": "bos", "arena_name": "TD Garden", "arena_description": "Opened in 1995, the $160 million TD Garden (then known as the FleetCenter) replaced one of the NBA's classic venues, the old Boston \"Gah-den.\" The arena also is home to the NHL's Bruins and holds numerous college and other entertainment events. According to the team's Web site, the arena was the first in the country to offer an HD scoreboard. The unique parquet flooring was brought in from the old Garden. The Sports Museum inside the TD Garden features various exhibits and memorabilia dedicated to the rich tradition of New England sports. (The museum is open daily from 10 a.m. to 4 p.m.; Garden tours are conducted every hour from 11 a.m. to 3 p.m.) The facility hosted the 2001 U.S. Figure Skating Championships, the 1996 and 2000 US Gymnastics Trials, the 1998 and 2004 NCAA Men's Frozen Four, the 1996 NHL All-Star Game, the 2008 and 2010 NBA Finals and the 2011 Stanley Cup finals."}, "Miami Heat": {"coach": "Erik Spoelstra", "players": ["Bam Adebayo", "Goran Dragic", "Wayne Ellington", "AJ Hammons", "Udonis Haslem", "James Johnson", "Tyler Johnson", "Rodney McGruder", "Jordan Mickey", "Kelly Olynyk", "Josh Richardson", "Dion Waiters", "Derrick Walton Jr.", "Okaro White", "Hassan Whiteside", "Matt Williams", "Justise Winslow"], "abbrev": "mia", "arena_name": "AmericanAirlines Arena", "arena_description": "The Heat played at Miami Arena from its inception in 1989 until 2000, when it moved three blocks east to AmericanAirlines Arena, located in downtown Miami on picturesque Biscayne Bay. The arena boasts the Miami Media Mesh outdoor LED marquee, which, at more than 3,400 square feet, is the largest LED board of its kind on any arena or stadium in the country. When flying over the facility you can see the silhouette of a giant AmericanAirlines aircraft painted on the roof."}, "Orlando Magic": {"coach": "Frank Vogel", "players": ["Arron Afflalo", "D.J. Augustin", "Khem Birch", "Bismack Biyombo", "Troy Caupain", "Evan Fournier", "Aaron Gordon", "Mario Hezonja", "Jonathan Isaac", "Wesley Iwundu", "Shelvin Mack", "Adreian Payne", "Elfrid Payton", "Terrence Ross", "Damjan Rudez", "Jonathon Simmons", "Marreese Speights", "Nikola Vucevic"], "abbrev": "orl", "arena_name": "Amway Center", "arena_description": "The Magic have a new home, the Amway Center, for the 2010-11 season, after spending their first 21 seasons at the Amway Arena, originally called the Orlando Arena or O-Rena. The original facility was entirely publicly financed for just less than $200 million. The $380 million Amway Center is more than double the size of its predecessor, with 875,000 square feet compared to 367,000. The Amway Center will have roughly 60 luxury suites, compared to 26 at Amway Arena, and more than 1,400 club seats, compared to zero at the old place. The new facility also features bars, clubs and restaurants on every seating level, as well as a 120-foot-tall tower with a tower club and observation deck. Tickets will be priced as low as $5. In addition to the Magic, the arena is the home of the Predators of the Arena Football League and the Solar Bears of the East Coast Hockey League. It also played host to the 2012 NBA All-Star Game."}, "Portland Trail Blazers": {"coach": "Terry Stotts", "players": ["Al-Farouq Aminu", "Zach Collins", "Pat Connaughton", "Ed Davis", "Maurice Harkless", "Jake Layman", "Meyers Leonard", "Damian Lillard", "CJ McCollum", "Shabazz Napier", "Andrew Nicholson", "Jusuf Nurkic", "Caleb Swanigan", "Evan Turner", "Noah Vonleh", "CJ Wilcox"], "abbrev": "por", "arena_name": "Moda Center", "arena_description": "The Trail Blazers sold out 810 straight games at Veterans Memorial Coliseum from 1977 to '95 before moving to the Rose Garden, the West Coast's largest arena, which was built at a cost of $267 million. The Rose Garden is owned by the team and managed by AEG Facilities. Named in homage to Portland's moniker as the Rose City, the arena boasts more than 735 televisions, an \"acoustical cloud\" to optimize sound for each event and a four-sided, state-of-the-art Mitsubishi high-definition scoreboard that was installed in 2007. The building is the centerpiece of Portland's 35-acre Rose Quarter campus, which hosted more events than any other complex in the world in 2008. The Rose Quarter -- which also includes Memorial Coliseum and the Commons, Portland's largest outdoor public plaza --  is located on the east bank of the Willamette River, minutes from downtown Portland."}, "Golden State Warriors": {"coach": "Steve Kerr", "players": ["Matt Barnes", "Jordan Bell", "Chris Boucher", "Omri Casspi", "Antonius Cleveland", "Stephen Curry", "Kevin Durant", "Draymond Green", "Andre Iguodala", "Damian Jones", "Shaun Livingston", "Kevon Looney", "James Michael McAdoo", "Patrick McCaw", "JaVale McGee", "Georges Niang", "Zaza Pachulia", "Klay Thompson", "David West", "Nick Young"], "abbrev": "gs", "arena_name": "Oracle Arena", "arena_description": "The arena opened in 1966 as the Coliseum and is the oldest in the NBA. The facility was completely renovated, at a cost of $121 million, in time for the 1997-98 Warriors season, adding 4,000 seats plus luxury suites. Oracle Corporation received a 10-year naming rights deal in 2006. The old Coliseum hosted many teams and events, including the Bay Bombers of roller derby fame, the California Golden Seals of the NHL and the Golden Bay Earthquakes of the MISL. Oracle Arena is adjacent to the Oakland-Alameda County Coliseum, home of the NFL's Raiders and the Athletics of Major League Baseball."}, "New York Knicks": {"coach": "Jeff Hornacek", "players": ["Carmelo Anthony", "Jamel Artis", "Ron Baker", "Michael Beasley", "Damyean Dotson", "Tim Hardaway Jr.", "Nigel Hayes", "Willy Hernangomez", "Ognjen Jaramaz", "Luke Kornet", "Mindaugas Kuzminskas", "Courtney Lee", "Joakim Noah", "Frank Ntilikina", "Kyle O'Quinn", "Kristaps Porzingis", "Chasson Randle", "Xavier Rathan-Mayes", "Ramon Sessions", "Lance Thomas", "Sasha Vujacic"], "abbrev": "ny", "arena_name": "Madison Square Garden", "arena_description": "This is actually the fourth version of Madison Square Garden, which bills itself as \"The World's Most Famous Arena.\" It would be hard to argue, considering the building hosts more than 300 events every year and has been the scene of some of the most famous sporting and entertainment events in the nation -- everything from the first two Ali-Frazier fights to Republican and Democratic National Conventions to Stanley Cup finals to the Westminster Kennel Club Dog Show. MSG is undergoing a major renovation that will add, among other amenities, luxury suites and clubs; increase and diversify food options; and widen concourses. The arena also is home to the NHL's Rangers and the WNBA's Liberty, and its other venues -- the Theater at Madison Square Garden, for one --  have been the host of the NFL and NBA drafts and the Grammy Awards."}, "Washington Wizards": {"coach": "Scott Brooks", "players": ["Bradley Beal", "Trey Burke", "Tim Frazier", "Marcin Gortat", "Sheldon Mac", "Ian Mahinmi", "Chris McCullough", "Jodie Meeks", "Markieff Morris", "Daniel Ochefu", "Kelly Oubre Jr.", "Otto Porter Jr.", "Devin Robinson", "Tomas Satoransky", "Mike Scott", "Donald Sloan", "Jason Smith", "John Wall", "Michael Young"], "abbrev": "wsh", "arena_name": "Capital One Arena", "arena_description": "Originally known as the MCI Center, the $260 million Verizon Center opened in 1997 in the heart of downtown Washington and has helped bring a $6.2 billion revitalization to the Chinatown area, according to the arena website. The marquee is written in English and Chinese. Fans can visit the Sports Gallery and Hall of Fame, an interactive exhibit area filled with memorabilia. Debuting for the 2007-2008 season, the high-definition LED scoreboard is the first of its kind indoors, according to the arena's website. The \"Phone Booth,\" as it is also commonly known, is home to the NHL's Capitals, WNBA's Mystics and Georgetown University's basketball team. The arena hosted the 2009 NCAA men's hockey tournament (aka, the Frozen Four). More than 220 events are held at the Verizon Center each year, according to the arena's website."}, "Dallas Mavericks": {"coach": "Rick Carlisle", "players": ["Brandon Ashley", "J.J. Barea", "Harrison Barnes", "Gian Clavell", "Seth Curry", "PJ Dozier", "Yogi Ferrell", "Dorian Finney-Smith", "Devin Harris", "Maximilian Kleber", "Wesley Matthews", "Josh McRoberts", "Salah Mejri", "Johnathan Motley", "Nerlens Noel", "Dirk Nowitzki", "Dwight Powell", "Dennis Smith Jr.", "Maalik Wayns", "Jeff Withey"], "abbrev": "dal", "arena_name": "American Airlines Center", "arena_description": "American Airlines Center, opened in 2001, replaced Reunion Arena, the Mavericks' home for 21 years. The AAC, as it is popularly called, is the main feature of Victory Park, an ongoing development of office buildings, condominiums and retail shops. The $420 million arena has granite, brick and limestone arches. Victory Plaza features fountains and a huge movie screen for outdoor showings. The arena's retractable seating allows for better sight lines and an easier conversion from basketball to the NHL's Stars, according to the arena website."}, "Sacramento Kings": {"coach": "David Joerger", "players": ["Bogdan Bogdanovic", "Vince Carter", "Willie Cauley-Stein", "Jack Cooley", "De'Aaron Fox", "Harry Giles", "Buddy Hield", "George Hill", "Justin Jackson", "Kosta Koufos", "Skal Labissiere", "Frank Mason III", "Georgios Papagiannis", "Zach Randolph", "Malachi Richardson", "JaKarr Sampson", "Garrett Temple"], "abbrev": "sac", "arena_name": "Sleep Train Arena", "arena_description": "When the Kings moved from Kansas City in 1985, they played at the original Arco Arena (also known as Sacramento Sports Arena) for three seasons. The current facility, which in October 2012 was renamed Sleep Train Arena from Power Balance Pavilion, opened at a cost of $40 million, the least expensive in the league. The floors in the seating area are made of hardwood, making the arena one of the loudest in the NBA -- as evidenced by the noise meter on the scoreboard."}, "Los Angeles Clippers": {"coach": "Doc Rivers", "players": ["Alan Anderson", "Patrick Beverley", "Sam Dekker", "Jawun Evans", "Danilo Gallinari", "Blake Griffin", "Montrezl Harrell", "Darrun Hilliard", "Brice Johnson", "Wesley Johnson", "DeAndre Jordan", "DeAndre Liggins", "Marshall Plumlee", "Willie Reed", "Austin Rivers", "Milos Teodosic", "Sindarius Thornwell", "Tyrone Wallace", "Lou Williams", "Jamil Wilson"], "abbrev": "lac", "arena_name": "Staples Center", "arena_description": "The Clippers started as the Buffalo Braves before moving to San Diego from 1978 to 1984. The Clippers played at the Los Angeles Memorial Sports Arena from 1984 to 1999 before joining the Lakers and the NHL's Kings at Staples Center. (The WNBA's Sparks have also played here since 2001.) The 2008-09 season marked the Clippers' 25th in Los Angeles. In 2012, the arena hosted three playoff teams -- the Kings, Clippers and Lakers -- for the first time."}, "Oklahoma City Thunder": {"coach": "Billy Donovan", "players": ["Alex Abrines", "Steven Adams", "Semaj Christon", "Norris Cole", "Nick Collison", "Raymond Felton", "Terrance Ferguson", "Paul George", "Jerami Grant", "Daniel Hamilton", "Josh Huestis", "Dakari Johnson", "Enes Kanter", "Doug McDermott", "Patrick Patterson", "Andre Roberson", "Kyle Singler", "Russell Westbrook"], "abbrev": "okc", "arena_name": "Chesapeake Energy Arena", "arena_description": "Chesapeake Energy Arena, previously Oklahoma City Arena, actually hosted NBA games before the Thunder moved to Oklahoma from Seattle for the 2008-09 season. The Hornets played parts of the 2005-06 and 2006-07 seasons here after they were displaced by Hurricane Katrina. In July 2011, the Thunder and Chesapeake Energy agreed to a 12-year naming rights deal."}, "Charlotte Hornets": {"coach": "Steve Clifford", "players": ["Dwayne Bacon", "Nicolas Batum", "Michael Carter-Williams", "Treveon Graham", "Isaiah Hicks", "Dwight Howard", "Frank Kaminsky", "Michael Kidd-Gilchrist", "Jeremy Lamb", "Mangok Mathiang", "Malik Monk", "Johnny O'Bryant III", "Marcus Paige", "Julyan Stone", "Kemba Walker", "Marvin Williams", "T.J. Williams", "Cody Zeller"], "abbrev": "cha", "arena_name": "Time Warner Cable Arena", "arena_description": "The $260 million arena opened in 2005 as Charlotte Bobcats Arena before Time Warner Cable bought naming rights. The arena has the largest video screen of any indoor arena in the country (38 feet high by 36 feet wide), according to the arena website. A unique feature of the scoreboard is a cityscape, displaying the Charlotte skyline. The arena also has incorporated the theme, \"A Celebration of Gathering,\" and encourages conversation along its open terraces, walkways and other public areas."}, "Milwaukee Bucks": {"coach": "Jason Kidd", "players": ["Giannis Antetokounmpo", "Malcolm Brogdon", "Sterling Brown", "Matthew Dellavedova", "Spencer Hawes", "John Henson", "Bronson Koenig", "JeQuan Lewis", "Thon Maker", "Khris Middleton", "Greg Monroe", "Jalen Moore", "Jabari Parker", "Gary Payton II", "Tony Snell", "Mirza Teletovic", "Jason Terry", "Rashad Vaughn", "D.J. Wilson"], "abbrev": "mil", "arena_name": "BMO Harris Bradley Center", "arena_description": "The BMO Harris Bradley Center, opened in 1988, is the NBA's only arena that was given as a gift. The late Jane Pettit and her husband, Lloyd Pettit, gave the $91 million arena to the city and state of Wisconsin in memory of Jane's late father, Harry Bradley. The exterior features fired granite, the same material used in constructing the pedestals and columns of the two glass-enclosed atriums, according to the arena website. It also is home to Marquette University and the minor-league hockey Milwaukee Admirals. The BMO Harris Bradley Center hosted the Frozen Four NCAA hockey championships in 1993, 1997 and 2006, as well as the NCAA men's basketball regionals in 1992, 1996, 1999, 2004 and 2010."}, "Memphis Grizzlies": {"coach": "David Fizdale", "players": ["Tony Allen", "Wade Baldwin IV", "Dillon Brooks", "Mario Chalmers", "Mike Conley", "Troy Daniels", "Deyonta Davis", "James Ennis III", "Tyreke Evans", "Marc Gasol", "JaMychal Green", "Andrew Harrison", "Jarell Martin", "Ben McLemore", "Chandler Parsons", "Ivan Rabb", "Wayne Selden", "Kobi Simmons", "Brandan Wright", "Rade Zagorac"], "abbrev": "mem", "arena_name": "FedExForum", "arena_description": "The franchise played in Vancouver, British Columbia, from 1995 to 2001 before moving to Memphis. Here the Grizzlies played at Pyramid Arena for three seasons until the $250 million FedExForum opened in 2004. The dome-shaped arena features the history of music in Memphis throughout the building, with various murals, pictures and music-themed restaurants and clubs. According to the arena website, it also is the first in the NBA to have \"see through\" shot clocks, allowing fans behind the baskets to see play without the clocks blocking their view. FedExForum also is home to the University of Memphis Tigers."}, "Toronto Raptors": {"coach": "Dwane Casey", "players": ["OG Anunoby", "Lorenzo Brown", "Bruno Caboclo", "DeMar DeRozan", "Serge Ibaka", "Kyle Lowry", "KJ McDaniels", "Kennedy Meeks", "CJ Miles", "Malcolm Miller", "Lucas Nogueira", "Jakob Poeltl", "Norman Powell", "Pascal Siakam", "Jonas Valanciunas", "Fred VanVleet", "Kyle Wiltjer", "Delon Wright"], "abbrev": "tor", "arena_name": "Air Canada Centre", "arena_description": "Originally the site of the Canada Post Delivery building, Air Canada Centre has used parts of the original building in its east and south sections. Air Canada has a 20-year agreement for the naming rights to the building. The arena's Galleria is the main entrance and features food courts and retail shops. Air Canada Centre also has 1,020 club seats and 150 luxury suites, in addition to a Molson microbrewery on site. The Rogers Media Centre provides up-to-the-minute sports results and news. The arena also is home to the Maple Leafs. Adjacent to the arena is Maple Leaf Square, a $500 million commercial, residential and entertainment complex that opened in 2010."}, "Utah Jazz": {"coach": "Quin Snyder", "players": ["Joel Bolomboy", "Tony Bradley", "Alec Burks", "Dante Exum", "Derrick Favors", "Rudy Gobert", "Eric Griffin", "Rodney Hood", "Joe Ingles", "Jonas Jerebko", "Joe Johnson", "Donovan Mitchell", "Raul Neto", "Royce O'Neale", "Ricky Rubio", "Thabo Sefolosha", "Ekpe Udoh", "Nigel Williams-Goss"], "abbrev": "utah", "arena_name": "Vivint Smart Home Arena", "arena_description": "The $93 million Vivint Smart Home Arena -- previously known as EnergySolutions Arena -- opened in 1991 as the Delta Center, which had replaced the Salt Palace as the Utah Jazz's first home starting in 1979. In 1999, the arena suffered $3.75 million worth of damage to the roof from a tornado. EnergySolutions bought the naming rights to the arena in November 2006. The arena was used for figure skating and short-track speed skating during the 2002 Winter Olympics and has twice hosted the NBA Finals. Statues of Jazz greats John Stockton and Karl Malone are on display outside the arena. Jazztown is part of the upper bowl area where fans can enjoy special features on the fifth-level concourse, including Jazz tattoos and commemorative photos. The building received more than $4 million of renovations and improvements in summer 2010, adding more retail and dining options, including several pubs and clubs."}, "Phoenix Suns": {"coach": "Earl Watson", "players": ["Dragan Bender", "Eric Bledsoe", "Devin Booker", "Tyson Chandler", "Marquese Chriss", "Jared Dudley", "Josh Jackson", "Mike James", "Derrick Jones Jr.", "Brandon Knight", "Alex Len", "Elijah Millsap", "Alec Peters", "Ronnie Price", "Davon Reed", "Tyler Ulis", "TJ Warren", "Alan Williams"], "abbrev": "phx", "arena_name": "Talking Stick Resort Arena", "arena_description": "The Suns played at Veterans Memorial Coliseum from their first season in 1968 until 1992, when America West Arena was built for $90 million. US Airways bought America West in 2005. The arena was considered ahead of its time, according to the arena website, with 88 luxury suites and more than 2,200 club seats, and its design spawned several similar arenas in the NBA's Western Conference. The arena hosted the 1995 and 2009 NBA All-Star Games and also is home to the Mercury of the WNBA. In December 2014, the arena was renamed the Talking Stick Resort Arena."}, "Minnesota Timberwolves": {"coach": "Tom Thibodeau", "players": ["Cole Aldrich", "Nemanja Bjelica", "Anthony Brown", "Jimmy Butler", "Jamal Crawford", "Gorgui Dieng", "Marcus Georges-Hunt", "Taj Gibson", "Tyus Jones", "Shabazz Muhammad", "Justin Patton", "Brandon Rush", "Jeff Teague", "Karl-Anthony Towns", "Andrew Wiggins"], "abbrev": "min", "arena_name": "Target Center", "arena_description": "Opened in 1990, Target Center underwent a major renovation in 2004, when all seats were replaced and capacity was increased. The floor is one of only two moveable floors in the country, according to the arena website. Target Center also offers covered skyway bridges connected to numerous downtown shopping and retail districts. The U.S. Bank Theater located in the arena can be converted into seating from 2,500 to 7,500. Target Center also is home of the WNBA's Minnesota Lynx. Tours of Target Center are available the first Thursday of every month at 2 p.m."}, "New Orleans Pelicans": {"coach": "Alvin Gentry", "players": ["Alexis Ajinca", "Omer Asik", "Ian Clark", "Charles Cooke", "DeMarcus Cousins", "Jordan Crawford", "Dante Cunningham", "Anthony Davis", "Cheick Diallo", "Solomon Hill", "Jrue Holiday", "Frank Jackson", "Jalen Jones", "Darius Miller", "E'Twaun Moore", "Quincy Pondexter", "Rajon Rondo"], "abbrev": "no", "arena_name": "Smoothie King Center", "arena_description": "The Hornets were one of four expansion teams created in 1988 and played in Charlotte for 14 seasons before moving to New Orleans in 2002. Because of the damage to the city by Hurricane Katrina, the team was forced to relocate temporarily to Oklahoma City during the 2005-06 and 2006-07 seasons. The Hornets returned full time to New Orleans for the 2007-08 season and experienced the most successful season in franchise history, while committing their resources to revitalizing the entire Gulf Coast. To continue these rebuilding efforts and to show the world that New Orleans was thriving, the NBA awarded the Hornets' hometown of New Orleans with the 2008 NBA All-Star Game, and returning here for the 2014 game."}, "Cleveland Cavaliers": {"coach": "Tyronn Lue", "players": ["Jose Calderon", "Jae Crowder", "Kay Felder", "Channing Frye", "Jeff Green", "LeBron James", "Richard Jefferson", "Dahntay Jones", "Kyle Korver", "Kevin Love", "Cedi Osman", "Derrick Rose", "Iman Shumpert", "JR Smith", "Edy Tavares", "Isaiah Thomas", "Tristan Thompson", "Deron Williams", "Derrick Williams", "Ante Zizic"], "abbrev": "cle", "arena_name": "Quicken Loans Arena", "arena_description": "From 1974 until 1993 the Cavaliers played at the 20,273-seat Richfield Coliseum, south of the city. Opened in 1994 as Gund Arena, then named after Cavaliers owner Gordon Gund, the arena was considered one of the league's most modern. Dan Gilbert, chairman and founder of Quicken Loans online home lender, bought the team in 2005 and has invested $40 million in arena updates, which include a completely redesigned and expanded team shop that now covers two levels. According to the arena website, 60 percent of the seats are in the lower bowl. \"The Q,\" as it is known, also is home to the American Hockey League's Lake Erie Monsters."}, "Atlanta Hawks": {"coach": "Mike Budenholzer", "players": ["Luke Babbitt", "Kent Bazemore", "Marco Belinelli", "DeAndre' Bembry", "Nicolas Brussino", "John Collins", "Quinn Cook", "Dewayne Dedmon", "Malcolm Delaney", "Tyler Dorsey", "Kris Humphries", "Ersan Ilyasova", "Mike Muscala", "Miles Plumlee", "Taurean Prince", "Dennis Schroder"], "abbrev": "atl", "arena_name": "Philips Arena", "arena_description": "Philips Arena occupies the site of the Omni Coliseum, Atlanta's former sports arena, and also is home to the NHL's Thrashers and the Dream of the WNBA. On Nov. 4, 1999, the Hawks opened their 1999-2000 season at Philips. Philips Arena's sports attendance record of 20,425 was set May 2, 2008, during the Hawks' playoff victory over the Celtics, in Game 6 of their first-round series. The interactive \"Philips Experience\" is a 10,000 square-foot space that features Philips products, a live stage and games. Philips Arena, built for $213 million, also differs from other NBA arenas in that all of the luxury and club seats (a total of 1,866) are on one side. The venue's grand entrance celebrates the city, spelling \"ATLANTA\" in 65-foot high letters illuminated with fiber-optic lighting, according to the team's website. Tours of the arena are available daily every half-hour: from 9 a.m. to 6 p.m. on non-event days, and 9 a.m. to 5 p.m. on game days. Hawk Walk features a food court and retail stores and connects the arena to CNN Center, MARTA and the Georgia World Congress Center."}, "Brooklyn Nets": {"coach": "Kenny Atkinson", "players": ["Quincy Acy", "Jarrett Allen", "Trevor Booker", "DeMarre Carroll", "Allen Crabbe", "Spencer Dinwiddie", "Randy Foye", "Joe Harris", "Rondae Hollis-Jefferson", "Sean Kilpatrick", "Caris LeVert", "Jeremy Lin", "Timofey Mozgov", "Yakuba Ouattara", "D'Angelo Russell", "Isaiah Whitehead", "Jacob Wiley"], "abbrev": "bkn", "arena_name": "Barclays Center", "arena_description": "Not since the Dodgers left for Los Angeles in 1957 had Brooklyn had a major pro sports team. That changed for the 2012-13 season, when the Brooklyn Nets took the court at the new Barclays Center in the heart of the borough. The Nets, founded in 1967, were an original franchise in the American Basketball Association, and played their first games in Teaneck, N.J. The Nets have long taken a back seat to the Big Apple's Knicks and most recently shared Prudential Center in Newark (2010-12) with the New Jersey Devils after a similar arena arrangement with the NHL franchise in the Meadowlands for nearly three decades. The Nets announced plans to move to Brooklyn in 2004."}, "Indiana Pacers": {"coach": "Nate McMillan", "players": ["Lavoy Allen", "Ike Anigbogu", "Bojan Bogdanovic", "Aaron Brooks", "Darren Collison", "Al Jefferson", "Cory Joseph", "T.J. Leaf", "Ben Moore", "Victor Oladipo", "Alex Poythress", "Glenn Robinson III", "Domantas Sabonis", "Lance Stephenson", "Edmond Sumner", "Myles Turner", "Damien Wilkins", "Joe Young", "Thaddeus Young"], "abbrev": "ind", "arena_name": "Bankers Life Fieldhouse", "arena_description": "Opened in 1999, Bankers Life Fieldhouse replaced Conseco Fieldhouse as the Pacers' home. The venue was originally known as Market Square Arena. Bankers Life Fieldhouse is thought to have started the NBA's retro-style arena scheme and has been likened to Oriole Park at Camden Yards for its nostalgic look. The outside facade has glass and brick suiting its surroundings. Bankers Life Fieldhouse has 69 suites and 2,400 club seats. It also is home to the WNBA's Fever. It hosted the World Basketball Championships in 2002 and the World Short Course Swimming Championships in 2004. The arena will host the Big Ten men's and women's basketball tournaments in 2014 and 2016."}, "Denver Nuggets": {"coach": "Michael Malone", "players": ["Darrell Arthur", "Will Barton", "Malik Beasley", "Wilson Chandler", "Torrey Craig", "Kenneth Faried", "Gary Harris", "Juan Hernangomez", "Roy Hibbert", "Nikola Jokic", "Tyler Lydon", "Trey Lyles", "Paul Millsap", "Monte Morris", "Emmanuel Mudiay", "Jamal Murray", "Jameer Nelson", "Mason Plumlee"], "abbrev": "den", "arena_name": "Pepsi Center", "arena_description": "Opened in 1999, the $180 million Pepsi Center -- \"The Can\" to locals -- is home to the Nuggets, the NHL's Colorado Avalanche and the National Lacrosse League's Colorado Mammoth. Various basketball and hockey players are depicted in action poses on a suspended sculpture in the arena's atriums. Views of the Rocky Mountains are seen from the large windows in the concourses. The total weight of the basketball floor is 41,625 pounds, according to the arena website, and is configured with 233 pieces. Pepsi Center has hosted numerous NCAA basketball events and the 2008 NCAA Frozen Four hockey championship, the 2005 NBA All-Star Game and was the site of the 2008 Democratic National Convention. A 75-minute tour is available Mondays, Wednesdays, Fridays and Saturdays from September through May, and Mondays, Wednesdays and Fridays June through August."}}